
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>01 - 嵐の前触れ · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="02.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    GitBookでGitHubと遊ぶ
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="01.html">
            
                <a href="01.html">
            
                    
                    01 - 嵐の前触れ
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="02.html">
            
                <a href="02.html">
            
                    
                    02 - Love と Happy
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="03.html">
            
                <a href="03.html">
            
                    
                    03 - 四種の神器
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >01 - 嵐の前触れ</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="01---&#x5D50;&#x306E;&#x524D;&#x89E6;&#x308C;">01 - &#x5D50;&#x306E;&#x524D;&#x89E6;&#x308C;</h1>
<p>&#x79C1;&#x304C;&#x30D1;&#x30BD;&#x30B3;&#x30F3;&#x3067;GitBook&#x306E;&#x30DE;&#x30CB;&#x30E5;&#x30A2;&#x30EB;&#x3092;&#x8AAD;&#x3093;&#x3067;&#x3044;&#x308B;&#x3068;&#xFF0C;&#x9759;&#x5BC2;&#x3092;&#x4FDD;&#x3063;&#x3066;&#x3044;&#x305F;EeePC&#x304C;&#x7A81;&#x7136;&#x53E3;&#x3092;&#x958B;&#x3044;&#x305F;&#x3002;&#x300C;&#x3044;&#x307E;&#x4F55;&#x3092;&#x3084;&#x3063;&#x3066;&#x3044;&#x308B;&#x3093;&#x3060;&#x300D;  </p>
<p>&#x300C;&#x5B9F;&#x8DF5;&#x30ED;&#x30A4;&#x30E4;&#x30EB;&#x82F1;&#x6587;&#x6CD5;&#x300D;  </p>
<p>&#x300C;&#x7D76;&#x5BFE;&#x9055;&#x3046;&#x306A;&#x300D;EeePC&#x304C;&#x5373;&#x5EA7;&#x306B;&#x5426;&#x5B9A;&#x3059;&#x308B;&#x3002;&#x300C;&#x3069;&#x3046;&#x3057;&#x3066;&#x300D;&#x300C;&#x305D;&#x306E;&#x672C;&#x306F;PC&#x3067;&#x8AAD;&#x3081;&#x308B;&#x7248;&#x3092;&#x51FA;&#x3057;&#x3066;&#x3044;&#x306A;&#x3044;&#x300D;&#x300C;&#x81EA;&#x708A;&#x3057;&#x305F;&#x304B;&#x3082;&#x3057;&#x308C;&#x306A;&#x3044;&#x300D;&#x300C;&#x541B;&#x306F;ScanSnap&#x3092;&#x6301;&#x3063;&#x3066;&#x3044;&#x306A;&#x3044;&#x300D;&#x300C;1&#x30DA;&#x30FC;&#x30B8;&#x305A;&#x3064;&#x30B9;&#x30AD;&#x30E3;&#x30F3;&#x3057;&#x305F;&#x3093;&#x3060;&#x3088;&#x300D;&#x300C;&#x66F8;&#x985E;&#x306E;&#x30B3;&#x30D4;&#x30FC;&#x3059;&#x3089;&#x9762;&#x5012;&#x304F;&#x3055;&#x304C;&#x308B;&#x541B;&#x304C;&#x305D;&#x3093;&#x306A;&#x3053;&#x3068;&#x3059;&#x308B;&#x306F;&#x305A;&#x306A;&#x3044;&#x3060;&#x308D;&#x3046;&#x300D;&#x300C;&#x305D;&#x3093;&#x306A;&#x306B;&#x79C1;&#x3063;&#x3066;&#x305A;&#x307C;&#x3089;&#x304B;&#x306A;&#x300D;&#x300C;&#x5C11;&#x306A;&#x304F;&#x3068;&#x3082;&#x79C1;&#x306E;&#x524D;&#x3067;&#x5E73;&#x6C17;&#x3067;&#x304A;&#x306A;&#x3089;&#x3059;&#x308B;&#x304F;&#x3089;&#x3044;&#x306B;&#x306F;&#x300D;&#x300C;&#x3061;&#x3087;&#x3063;&#x3068;&#xFF0C;&#x3084;&#x3081;&#x3066;&#x3088;&#x305D;&#x3046;&#x3044;&#x3046;&#x3053;&#x3068;&#x8A00;&#x3046;&#x306E;&#x300D;  </p>
<p>EeePC&#x306F;&#x9577;&#x304D;&#x306B;&#x308F;&#x305F;&#x3063;&#x3066;&#x79C1;&#x306E;&#x30A2;&#x30B7;&#x30B9;&#x30BF;&#x30F3;&#x30C8;&#x3092;&#x52D9;&#x3081;&#x308B;&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;&#x3060;&#x3002;&#x3057;&#x3070;&#x3089;&#x304F;&#x9759;&#x990A;&#x3057;&#x3066;&#x3044;&#x305F;&#x304C; <a href="https://jamcha-aa.gitbook.io/eeepc/" target="_blank">EeePC&#x3068;Emacs&#x3068;&#x25CB;&#x25CB;&#x3068;</a> &#x3067;&#x5FA9;&#x6D3B;&#x3057;&#xFF0C;&#x4EE5;&#x6765;&#xFF0C;&#x6301;&#x3061;&#x524D;&#x306E;&#x6BD2;&#x820C;&#x306B;&#x78E8;&#x304D;&#x3092;&#x304B;&#x3051;&#x3066;&#x3044;&#x308B;&#x3002;  </p>
<p>&#x300C;&#x305D;&#x308C;&#x3067;&#xFF0C;&#x4F55;&#x3092;&#x3057;&#x3066;&#x3044;&#x308B;&#x3093;&#x3060;&#x3002;&#x3044;&#x304F;&#x3064;&#x3082;&#x30BF;&#x30D6;&#x3092;&#x958B;&#x3044;&#x3066;&#x3044;&#x308B;&#x304C;&#x300D;&#x305D;&#x3046;&#x8A00;&#x308F;&#x308C;&#x305F;&#x79C1;&#x306F;&#x3069;&#x3053;&#x304B;&#x3089;&#x8AAC;&#x660E;&#x3059;&#x308C;&#x3070;&#x3044;&#x3044;&#x306E;&#x304B;&#x5C11;&#x3057;&#x8003;&#x3048;&#x305F;&#x3002;&#x300C;GitHub&#x3067;GitBook&#x3092;&#x4F7F;&#x304A;&#x3046;&#x3068;&#x601D;&#x3063;&#x3066;&#x300D;  </p>
<p>&#x300C;GitBook&#x306A;&#x3089;&#x3059;&#x3067;&#x306B;&#x4F7F;&#x3063;&#x3066;&#x3044;&#x308B;&#x3058;&#x3083;&#x306A;&#x3044;&#x304B;&#x300D;&#x300C;&#x3046;&#x3093;&#x3002;&#x3067;&#x3082;&#x81EA;&#x524D;&#x3067;GitBook&#x306B;&#x5909;&#x63DB;&#x3057;&#x305F;&#x3053;&#x3068;&#x304C;&#x306A;&#x304F;&#x3066;&#x8ABF;&#x3079;&#x3066;&#x305F;&#x306E;&#x300D;&#x300C;&#x81EA;&#x524D;&#x3067;&#x3084;&#x308B;&#x306E;&#x304C;&#x9762;&#x5012;&#x3060;&#x304B;&#x3089;GitBook&#x3092;&#x4F7F;&#x3063;&#x3066;&#x3044;&#x305F;&#x3093;&#x3058;&#x3083;&#x306A;&#x3044;&#x306E;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x305D;&#x3046;&#x306A;&#x3093;&#x3060;&#x3051;&#x3069;&#x3055;&#x3042;&#x30FC;&#x300D;  </p>
<p>&#x30AD;&#x30FC;&#x30DC;&#x30FC;&#x30C9;&#x304B;&#x3089;&#x624B;&#x3092;&#x96E2;&#x3057;&#x305F;&#x79C1;&#x306F;&#xFF0C;&#x8155;&#x3092;&#x7D44;&#x3093;&#x3067;&#x8003;&#x3048;&#x308B;&#x3002;&#x300C;&#x305A;&#x3045;&#x30FC;&#x3063;&#x3068;&#x6614;&#xFF0C;<a href="https://jamcha-aa.github.io/2016/08/31/orgmagit.html" target="_blank">magit&#x3067;GitHub&#x306B;&#x30B3;&#x30DF;&#x30C3;&#x30C8;&#x3059;&#x308B;&#x8A18;&#x4E8B;</a> &#x66F8;&#x3044;&#x305F;&#x3058;&#x3083;&#x306A;&#x3044;&#x300D;&#x300C;&#x79C1;&#x306F;&#x305D;&#x306E;&#x9803;&#x7720;&#x3063;&#x3066;&#x3044;&#x305F;&#x304B;&#x3089;&#x308F;&#x304B;&#x3089;&#x3093;&#x300D;&#x300C;&#x307E;&#x3042;&#xFF0C;&#x66F8;&#x3044;&#x305F;&#x3093;&#x3067;&#x3059;&#x3088;&#x3002;&#x305D;&#x308C;&#x3092;&#x4ECA;&#x898B;&#x305F;&#x3089;&#x3082;&#x3046;&#x308F;&#x304B;&#x308A;&#x306B;&#x304F;&#x304F;&#x3066;&#x300D;  </p>
<p>&#x305D;&#x3046;&#x8A00;&#x3063;&#x3066;EeePC&#x306B;&#x4EF6;&#x306E;&#x30D6;&#x30ED;&#x30B0;&#x8A18;&#x4E8B;&#x3092;&#x898B;&#x305B;&#x308B;&#x3068;&#xFF0C;&#x30B9;&#x30AF;&#x30ED;&#x30FC;&#x30EB;&#x3059;&#x308B;&#x3054;&#x3068;&#x306B;EeePC&#x304C;&#x3046;&#x306A;&#x308B;&#x3002;&#x300C;&#x3053;&#x308C;&#x306F;&#x3072;&#x3069;&#x3044;&#x300D;&#x300C;&#x76F4;&#x63A5;&#x305D;&#x3046;&#x8A00;&#x308F;&#x308C;&#x308B;&#x3068;&#x50B7;&#x3064;&#x304F;&#x306A;&#x300D;&#x300C;&#x3053;&#x3093;&#x306A;&#x6709;&#x5BB3;&#x306A;&#x3082;&#x306E;&#x3092;&#x307E;&#x3060;&#x516C;&#x958B;&#x3057;&#x3066;&#x3044;&#x308B;&#x306E;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x6709;&#x5BB3;&#x3063;&#x3066;&#xFF0C;&#x306D;&#x3048;&#xFF0C;&#x6700;&#x8FD1;&#x3061;&#x3087;&#x3063;&#x3068;&#x8A00;&#x8449;&#x3065;&#x304B;&#x3044;&#x3072;&#x3069;&#x3059;&#x304E;&#x306A;&#x3044;&#xFF1F;&#x300D;&#x300C;&#x305D;&#x308C;&#x3067;&#x305D;&#x306E;&#x8A18;&#x4E8B;&#x3068;GitBook&#x306B;&#x4F55;&#x306E;&#x95A2;&#x4FC2;&#x304C;&#x3042;&#x308B;&#x3093;&#x3060;&#x300D;&#x300C;&#x2026;&#x300D;  </p>
<pre><code>$ sudo rm -rf /
</code></pre><p>&#x300C;&#x3084;&#x3081;&#x308D;!&#x300D;EeePC&#x304C;&#x6012;&#x9CF4;&#x3063;&#x305F;&#x3002;&#x300C;&#x3058;&#x3083;&#x3042;&#x8B1D;&#x3063;&#x3066;&#x3088;&#x300D;&#x300C;&#x8105;&#x3057;&#x306F;&#x7121;&#x99C4;&#x3060;&#x3002;&#x79C1;&#x3092;&#x6D88;&#x3057;&#x305F;&#x3068;&#x3053;&#x308D;&#x3067;&#x3042;&#x308C;&#x3058;&#x3083;&#x3060;&#x3081;&#x3060;&#x300D;&#x300C;&#x3060;&#x304B;&#x3089;&#x4ECA;&#x4F7F;&#x3063;&#x3066;&#x308B;&#x65B9;&#x6CD5;&#x3092;&#x7D39;&#x4ECB;&#x3057;&#x3088;&#x3046;&#x3068;&#x3057;&#x3066;&#x308B;&#x3093;&#x3058;&#x3083;&#x306A;&#x3044;&#x300D;&#x300C;GitBook&#x304B;&#x300D;&#x300C;&#x305D;&#x308C;&#x3068;magit&#x300D;&#x300C;&#x306A;&#x3089;&#x305D;&#x308C;&#x3092;&#x30D6;&#x30ED;&#x30B0;&#x8A18;&#x4E8B;&#x306B;&#x3059;&#x308C;&#x3070;&#x3044;&#x3044;&#x300D;&#x300C;&#x305D;&#x308C;&#x3060;&#x3068;&#x79C1;&#x304C;&#x9762;&#x767D;&#x304F;&#x306A;&#x3044;&#x300D;&#x300C;&#x9762;&#x767D;&#x304F;&#x306A;&#x3044;&#x3063;&#x3066;&#x300D;&#x300C;&#x77E5;&#x3063;&#x3066;&#x308B;&#x3053;&#x3068;&#x8AAC;&#x660E;&#x3059;&#x308B;&#x306E;&#x306F;&#x4ED5;&#x4E8B;&#x307F;&#x305F;&#x3044;&#x3067;&#x30A4;&#x30E4;&#x306A;&#x306E;&#x3002;&#x3060;&#x304B;&#x3089;&#x4ECA;&#x307E;&#x3067;&#x307B;&#x3063;&#x305F;&#x3089;&#x304B;&#x3057;&#x306B;&#x3057;&#x3066;&#x305F;&#x3093;&#x3060;&#x3082;&#x3093;&#x300D;&#x300C;&#x3046;&#x30FC;&#x3080;&#x300D;&#x300C;&#x305B;&#x3063;&#x304B;&#x304F;&#x79C1;&#x304C;&#x3084;&#x308B;&#x6C17;&#x306B;&#x306A;&#x3063;&#x305F;&#x3093;&#x3060;&#x304B;&#x3089;&#x3055;&#xFF0C;&#x5FDC;&#x63F4;&#x3057;&#x3066;&#x3088;&#x300D;&#x300C;&#x3080;&#x3046;&#x2026;&#x300D;&#x300C;&#x306D;&#xFF1F;&#x300D;  </p>
<p>&#x300C;&#x307E;&#x3042;&#xFF0C;&#x305D;&#x308C;&#x3067;&#x5185;&#x5BB9;&#x304C;&#x826F;&#x304F;&#x306A;&#x308B;&#x306A;&#x3089;&#x69CB;&#x308F;&#x306A;&#x3044;&#x304C;&#x300D;&#x3057;&#x3076;&#x3057;&#x3076;EeePC&#x306F;&#x8003;&#x3048;&#x3092;&#x53D7;&#x3051;&#x5165;&#x308C;&#x305F;&#x3002;&#x300C;&#x3058;&#x3083;&#x3042;&#x65E9;&#x901F;&#x3084;&#x308A;&#x65B9;&#x3092;&#x8AAC;&#x660E;&#x3057;&#x3066;&#x3082;&#x3089;&#x304A;&#x3046;&#x304B;&#x300D;  </p>
<p>&#x300C;&#x305D;&#x306E;&#x524D;&#x306B;&#x4E0B;&#x306E;&#x30B5;&#x30A4;&#x30C8;&#x3092;&#x53C2;&#x8003;&#x306B;&#x3057;&#x3066;&#x516C;&#x958B;&#x9375;&#x3092;GitHub&#x306B;&#x767B;&#x9332;&#x3057;&#x3066;&#x307B;&#x3057;&#x3044;&#x3002;&#x3053;&#x308C;&#x3084;&#x3089;&#x306A;&#x3044;&#x3068;&#x3059;&#x3054;&#x304F;&#x4E0D;&#x4FBF;&#x300D;  </p>
<p><a href="http://monsat.hatenablog.com/entry/generating-ssh-keys-for-github" target="_blank">SSH&#x306E;&#x516C;&#x958B;&#x9375;&#x3092;&#x4F5C;&#x6210;&#x3057;Github&#x306B;&#x767B;&#x9332;&#x3059;&#x308B;&#x624B;&#x9806;</a>  </p>
<p>&#x300C;&#x305D;&#x306E;&#x8AAC;&#x660E;&#x306F;&#x3053;&#x3053;&#x3067;&#x3057;&#x306A;&#x3044;&#x306E;&#x304B;&#x300D;&#x300C;&#x7D76;&#x5BFE;&#x3084;&#x3060;&#x3002;&#x3042;&#x3068;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x5165;&#x529B;&#x3092;&#x7701;&#x7565;&#x3067;&#x304D;&#x308B;&#x3068;&#x697D;&#x300D;  </p>
<p><a href="http://h2plus.biz/hiromitsu/entry/791" target="_blank">SSH&#x306E;&#x30D1;&#x30B9;&#x30D5;&#x30EC;&#x30FC;&#x30BA;&#x5165;&#x529B;&#x3092;&#x7701;&#x7565;&#x3059;&#x308B;&#x65B9;&#x6CD5;</a>  </p>
<p>&#x300C;&#x59CB;&#x3081;&#x308B;&#x524D;&#x304B;&#x3089;&#x305D;&#x3093;&#x306A;&#x624B;&#x629C;&#x304D;&#x3067;&#x3044;&#x3044;&#x306E;&#x304B;&#x300D;EeePC&#x304C;&#x3042;&#x304D;&#x308C;&#x308B;&#x3002;&#x300C;&#x306F;&#x3058;&#x3081;&#x306E;&#x8A2D;&#x5B9A;&#x304F;&#x3089;&#x3044;&#x5927;&#x76EE;&#x306B;&#x307F;&#x3066;&#x3088;&#x3002;&#x6B21;&#x304B;&#x3089;&#x3061;&#x3083;&#x3093;&#x3068;&#x8AAC;&#x660E;&#x3059;&#x308B;&#x304B;&#x3089;&#x300D;  </p>
<p><br><br><br><br>(c) 2018 jamcha (jamcha.aa@gmail.com).  </p>
<p><img src="https://i.creativecommons.org/l/by-sa/4.0/88x31.png" alt="cc by-sa">  </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: GitBookでGitHubと遊ぶ">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="02.html" class="navigation navigation-next " aria-label="Next page: 02 - Love と Happy">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"01 - 嵐の前触れ","level":"1.2","depth":1,"next":{"title":"02 - Love と Happy","level":"1.3","depth":1,"path":"02.md","ref":"02.md","articles":[]},"previous":{"title":"GitBookでGitHubと遊ぶ","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"01.md","mtime":"2018-07-23T14:13:28.990Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-07-24T10:10:55.251Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

