
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>04 - Magitサイクル · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="03.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    GitBookでGitHubと遊ぶ
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="01.html">
            
                <a href="01.html">
            
                    
                    01 - 嵐の前触れ
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="02.html">
            
                <a href="02.html">
            
                    
                    02 - Love と Happy
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="03.html">
            
                <a href="03.html">
            
                    
                    03 - 四種の神器
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.5" data-path="04.html">
            
                <a href="04.html">
            
                    
                    04 - Magitサイクル
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >04 - Magitサイクル</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="04---magit&#x30B5;&#x30A4;&#x30AF;&#x30EB;">04 - Magit&#x30B5;&#x30A4;&#x30AF;&#x30EB;</h1>
<p>&#x300C;&#x3046;&#x30FC;&#x3093;&#x2026;&#x300D;&#x79C1;&#x306E;&#x3046;&#x3081;&#x304D;&#x58F0;&#x306B;EeePC&#x304C;&#x305F;&#x307E;&#x3089;&#x305A;&#x58F0;&#x3092;&#x304B;&#x3051;&#x308B;&#x3002;&#x300C;&#x4ECA;&#x56DE;&#x306F;&#x5197;&#x8AC7;&#x304C;&#x304D;&#x304B;&#x306A;&#x305D;&#x3046;&#x3060;&#x306A;&#x300D;&#x300C;&#x3046;&#x3093;&#x300D;&#x300C;&#x4F55;&#x3060;&#xFF0C;&#x8A00;&#x3063;&#x3066;&#x307F;&#x308D;&#x300D;EeePC&#x306E;&#x554F;&#x3044;&#x304B;&#x3051;&#x306B;&#x79C1;&#x306F;&#x9ED9;&#x3063;&#x305F;&#x307E;&#x307E;&#x7B54;&#x3048;&#x306A;&#x3044;&#x3002;  </p>
<p>&#x79C1;&#x306E;&#x666E;&#x6BB5;&#x3068;&#x306F;&#x9055;&#x3046;&#x8868;&#x60C5;&#x306B;EeePC&#x3082;&#x591A;&#x5C11;&#x8EAB;&#x69CB;&#x3048;&#x308B;&#x3002;&#x300C;&#x9060;&#x616E;&#x3059;&#x308B;&#x306A;&#x3002;&#x771F;&#x9762;&#x76EE;&#x306B;&#x805E;&#x3044;&#x3066;&#x3084;&#x308B;&#x300D;&#x300C;&#x3046;&#x30FC;&#x3093;&#x2026;&#x300D;&#x8003;&#x3048;&#x3042;&#x3050;&#x306D;&#x305F;&#x79C1;&#x306F;&#x4ED5;&#x65B9;&#x306A;&#x304F;&#x6253;&#x3061;&#x660E;&#x3051;&#x308B;&#x3053;&#x3068;&#x306B;&#x3057;&#x305F;&#x3002;  </p>
<p>&#x300C;&#x79C1;&#x304C;&#x82E6;&#x52B4;&#x3057;&#x306A;&#x3044;&#x3067;GitHub&#x306B;&#x30B3;&#x30DF;&#x30C3;&#x30C8;&#x3067;&#x304D;&#x3066;&#x3044;&#x308B;&#x3053;&#x3068;&#x3092;&#x4F1D;&#x3048;&#x305F;&#x3044;&#x300D;&#x305D;&#x308C;&#x3092;&#x805E;&#x3044;&#x305F;EeePC&#x306F;&#x5446;&#x6C17;&#x306B;&#x53D6;&#x3089;&#x308C;&#x305F;&#x3088;&#x3046;&#x3060;&#x3002;&#x300C;&#x3082;&#x3046;&#x8A00;&#x3063;&#x305F;&#x3093;&#x3060;&#x304B;&#x3089;&#x305D;&#x308C;&#x3067;&#x7D42;&#x308F;&#x308A;&#x3058;&#x3083;&#x306A;&#x3044;&#x306E;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x9055;&#x3046;&#x306E;&#x3002;&#x8A00;&#x3044;&#x305F;&#x3044;&#x306E;&#x306F;&#x305D;&#x3046;&#x3044;&#x3046;&#x3053;&#x3068;&#x3058;&#x3083;&#x306A;&#x304F;&#x3066;&#x300D;  </p>
<p>&#x79C1;&#x306F;&#x771F;&#x5263;&#x306A;&#x76EE;&#x3067;&#x8A00;&#x3046;&#x3002;&#x300C;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x306E;&#x82E6;&#x624B;&#x306A;&#x79C1;&#x304C;&#x307E;&#x304C;&#x308A;&#x306A;&#x308A;&#x306B;&#x3082;Git&#x3067;&#x6570;&#x5343;&#x30B3;&#x30DF;&#x30C3;&#x30C8;&#x3067;&#x304D;&#x3066;&#x3044;&#x308B;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x306F;&#xFF0C;&#x4E00;&#x822C;&#x306B;&#x96E3;&#x3057;&#x3044; (<a href="https://gist.github.com/dukeofgaming/2150263" target="_blank">Morton, 2007</a>) &#x3068;&#x3044;&#x308F;&#x308C;&#x308B;Git&#x306E;&#x7406;&#x89E3;&#x3092;&#x4FC3;&#x9032;&#x3059;&#x308B;&#x8981;&#x56E0;&#x304C;&#x904E;&#x53BB;&#x306E;&#x5B66;&#x7FD2;&#x30D7;&#x30ED;&#x30BB;&#x30B9;&#x306B;&#x4ECB;&#x5728;&#x3057;&#x3066;&#x3044;&#x305F;&#x53EF;&#x80FD;&#x6027;&#x304C;&#x3042;&#x308B;&#x300D;EeePC&#x3082;&#x5FDC;&#x3058;&#x308B;&#x3002;&#x300C;&#x305D;&#x306E;&#x767A;&#x8A00;&#x306F;Linus&#x81EA;&#x8EAB;&#x304C;2015&#x5E74;&#x306E;&#x30A4;&#x30F3;&#x30BF;&#x30D3;&#x30E5;&#x30FC;&#x3067;<a href="https://jp.linux.com/news/linuxcom-exclusive/428524-lco2015041401" target="_blank">&#x5426;&#x5B9A;</a>&#x3057;&#x3066;&#x3044;&#x308B;&#x3002;&#x305D;&#x3082;&#x305D;&#x3082;&#x541B;&#x304C;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x304C;&#x82E6;&#x624B;&#x3067;&#x3042;&#x308B;&#x3068;&#x3044;&#x3046;&#x524D;&#x63D0;&#x81EA;&#x4F53;&#x304C;&#x8AA4;&#x308A;&#x3067;&#x3042;&#x308B;&#x53EF;&#x80FD;&#x6027;&#x3082;&#x3042;&#x308B;&#x300D;  </p>
<p>&#x300C;&#x307B;&#x3093;&#x3068;&#xFF1F;&#x300D;&#x601D;&#x308F;&#x305A;&#x79C1;&#x306E;&#x9854;&#x304C;&#x307B;&#x3053;&#x308D;&#x3076;&#x3002;&#x300C;&#x5F85;&#x3066;&#x3002;&#x8AD6;&#x7406;&#x306E;&#x8A71;&#x3092;&#x3057;&#x305F;&#x3060;&#x3051;&#x3060;&#x3002;&#x79C1;&#x306F;&#x5225;&#x306B;&#x2026;&#x300D;&#x300C;&#x306D;&#x3048;&#xFF0C;&#x79C1;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x3067;&#x304D;&#x308B;&#x4EBA;&#x306A;&#x306E;&#xFF1F;&#x300D;&#x300C;&#x82E6;&#x624B;&#x304B;&#x3069;&#x3046;&#x304B;&#x3068;&#x3067;&#x304D;&#x308B;&#x304B;&#x3069;&#x3046;&#x304B;&#x306F;&#x5225;&#x554F;&#x984C;&#x3060;&#x300D;EeePC&#x306F;&#x5FC3;&#x306A;&#x304F;&#x7A81;&#x304D;&#x653E;&#x3059;&#x3002;&#x3060;&#x304C;&#x3059;&#x3050;&#x306B;&#x52A9;&#x3051;&#x8239;&#x3092;&#x51FA;&#x3057;&#x305F;&#x3002;&#x300C;&#x305F;&#x3060;&#xFF0C;&#x541B;&#x304C;&#x3053;&#x308C;&#x307E;&#x3067;&#x308F;&#x304B;&#x3089;&#x306A;&#x304B;&#x3063;&#x305F;&#x3082;&#x306E;&#x304C;&#x308F;&#x304B;&#x308B;&#x3088;&#x3046;&#x306B;&#x306A;&#x3063;&#x305F;&#x3053;&#x3068;&#xFF0C;&#x305D;&#x306E;&#x4ED5;&#x7D44;&#x307F;&#x3092;&#x7406;&#x89E3;&#x3059;&#x308B;&#x3053;&#x3068;&#x81EA;&#x4F53;&#x306B;&#x306F;&#x610F;&#x7FA9;&#x304C;&#x3042;&#x308B;&#x3002;&#x8AAC;&#x660E;&#x3092;&#x3057;&#x3066;&#x304F;&#x308C;&#x300D;  </p>
<p>&#x305D;&#x308C;&#x304B;&#x3089;&#x79C1;&#x306F;&#x81EA;&#x5206;&#x304C;&#x521D;&#x5FC3;&#x8005;&#x5411;&#x3051;&#x306E;Git&#x5165;&#x9580;&#x3059;&#x3089;&#x7406;&#x89E3;&#x3067;&#x304D;&#x305A;&#x4F55;&#x5EA6;&#x3082;&#x632B;&#x6298;&#x3057;&#x305F;&#x904E;&#x53BB;&#x3092;&#x8A71;&#x3057;&#x305F;&#x3002;EeePC&#x306F;&#x8208;&#x5473;&#x304C;&#x306A;&#x3055;&#x305D;&#x3046;&#x3060;&#x3063;&#x305F;&#x3002;&#x300C;&#x305D;&#x308C;&#x3067;&#xFF0C;&#x3044;&#x3064;&#x5909;&#x308F;&#x3063;&#x305F;&#x3093;&#x3060;&#xFF1F;&#x300D;&#x300C;magit&#x3092;&#x4F7F;&#x3044;&#x306F;&#x3058;&#x3081;&#x3066;&#x304B;&#x3089;&#x300D;&#x300C;emacs&#x306E;git&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x3060;&#x306A;&#x300D;&#x300C;&#x3046;&#x3093;&#x300D;&#x300C;&#x4F55;&#x304C;&#x9055;&#x3063;&#x305F;&#x3093;&#x3060;&#xFF1F;&#x300D;  </p>
<p>&#x79C1;&#x306E;&#x76EE;&#x304C;&#x5909;&#x308F;&#x308B;&#x3002;&#x300C;&#x9032;&#x6B69;&#x3092;&#x611F;&#x3058;&#x305F;!&#x300D;&#x300C;&#x307B;&#x3046;&#x300D;&#x300C;Git&#x5165;&#x9580;&#x304C;&#x96E3;&#x3057;&#x3044;&#x3068;&#x601D;&#x3063;&#x3066;&#x3044;&#x305F;&#x7406;&#x7531;&#x306F;&#xFF0C;&#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3;&#x7BA1;&#x7406;&#x3063;&#x3066;&#x3044;&#x3046;&#x6982;&#x5FF5;&#x306E;&#x7406;&#x89E3;&#x3068;&#xFF0C;Git&#x306E;&#x64CD;&#x4F5C;&#x3092;&#x540C;&#x6642;&#x306B;&#x8981;&#x6C42;&#x3055;&#x308C;&#x3066;&#x305F;&#x304B;&#x3089;&#x3060;&#x3063;&#x3066;&#x308F;&#x304B;&#x3063;&#x305F;&#x306E;&#x300D;&#x300C;&#x3075;&#x3080;&#x300D;&#x300C;magit&#x306F;&#x305D;&#x308C;&#x81EA;&#x4F53;&#x306E;&#x4F7F;&#x3044;&#x65B9;&#x3092;&#x307E;&#x305A;&#x77E5;&#x3089;&#x306A;&#x3044;&#x3068;&#x3044;&#x3051;&#x306A;&#x304F;&#x3066;&#x300D;&#x300C;&#x3075;&#x3080;&#x300D;&#x300C;&#x305D;&#x306E;&#x64CD;&#x4F5C;&#x306B;&#x6163;&#x308C;&#x305F;&#x3089;&#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3;&#x7BA1;&#x7406;&#x3092;&#x5B66;&#x307C;&#x3046;&#x3063;&#x3066;&#x611F;&#x3058;&#x300D;&#x300C;&#x306A;&#x308B;&#x307B;&#x3069;&#x3002;&#x4E8C;&#x3064;&#x306E;&#x8981;&#x56E0;&#x3092;&#x9806;&#x756A;&#x306B;&#x5B66;&#x3076;&#x3053;&#x3068;&#x3067;&#x6DF7;&#x4E71;&#x3092;&#x9632;&#x3044;&#x3067;&#x3044;&#x308B;&#x308F;&#x3051;&#x3060;&#x306A;&#x300D;&#x300C;&#x3046;&#x3093;&#x3002;&#x305F;&#x3068;&#x3048;&#x3070;magit&#x3067;&#x30B3;&#x30DF;&#x30C3;&#x30C8;&#x3068;&#x30D7;&#x30C3;&#x30B7;&#x30E5;&#x306E;&#x624B;&#x9806;&#x3092;&#x307E;&#x3068;&#x3081;&#x308B;&#x3068;&#x3053;&#x3093;&#x306A;&#x56F3;&#x306B;&#x306A;&#x308B;&#x3093;&#x3060;&#x3051;&#x3069;&#x300D;  </p>
<p><br><br><img src="images/cycle1.png" alt="magit cycle">  </p>
<p><br><br>&#x300C;&#x306A;&#x3093;&#x3060;&#x3053;&#x308C;&#x306F;&#x300D;EeePC&#x304C;&#x3042;&#x304D;&#x308C;&#x305F;&#x3088;&#x3046;&#x306B;&#x8A00;&#x3046;&#x3002;&#x300C;&#x3055;&#x3063;&#x3071;&#x308A;&#x3067;&#x3057;&#x3087;&#xFF1F;&#x305D;&#x3053;&#x306B;&#x5B9F;&#x969B;&#x306E;&#x753B;&#x9762;&#x3092;&#x4E26;&#x3079;&#x308B;&#x3068;&#x3053;&#x3046;&#x306A;&#x308B;&#x300D;  </p>
<p><br><br><img src="images/cycle2.png" alt="magit cycle with real screen">  </p>
<p>&#x300C;&#x5168;&#x304F;&#x308F;&#x304B;&#x3089;&#x3093;&#x300D;&#x300C;&#x3060;&#x304B;&#x3089;&#x6700;&#x521D;&#x306F;&#x64CD;&#x4F5C;&#x3059;&#x308B;&#x3060;&#x3051;&#x3067;&#x7CBE;&#x4E00;&#x676F;&#x306A;&#x3093;&#x3060;&#x3051;&#x3069;&#xFF0C;&#x5B9F;&#x306F;&#x305D;&#x308C;&#x304C;&#x4E00;&#x756A;&#x306E;&#x8FD1;&#x9053;&#x306A;&#x3093;&#x3060;&#x3068;&#x601D;&#x3046;&#x3002;&#x81EA;&#x8EE2;&#x8ECA;&#x3092;&#x521D;&#x3081;&#x3066;&#x4E57;&#x308B;&#x3068;&#x304D;&#x306B;&#xFF0C;&#x307E;&#x305A;&#x30D0;&#x30E9;&#x30F3;&#x30B9;&#x3092;&#x53D6;&#x308B;&#x7DF4;&#x7FD2;&#x3060;&#x3051;&#x7D9A;&#x3051;&#x3066;&#xFF0C;&#x305D;&#x308C;&#x304B;&#x3089;&#x30DA;&#x30C0;&#x30EB;&#x3092;&#x3053;&#x3050;&#xFF0C;&#x307F;&#x305F;&#x3044;&#x306A;&#x300D;  </p>
<blockquote>
<p><a href="https://jp.linux.com/news/linuxcom-exclusive/428524-lco2015041401" target="_blank">&#x4E00;&#x822C;&#x7684;&#x306B; git &#x3092;&#x5B66;&#x3076;&#x6700;&#x9069;&#x306A;&#x65B9;&#x6CD5;&#x306F;&#x3001;&#x6700;&#x521D;&#x306F;&#x3054;&#x304F;&#x57FA;&#x672C;&#x7684;&#x306A;&#x3053;&#x3068;&#x3060;&#x3051;&#x3092;&#x884C;&#x3044;&#x3001;&#x57FA;&#x672C;&#x3092;&#x7FD2;&#x719F;&#x3057;&#x3066;&#x81EA;&#x4FE1;&#x304C;&#x6301;&#x3066;&#x308B;&#x3088;&#x3046;&#x306B;&#x306A;&#x308B;&#x307E;&#x3067;&#x306F;&#x3001;&#x305D;&#x306E;&#x4ED6;&#x306E;&#x3067;&#x304D;&#x308B;&#x3053;&#x3068;&#x306B;&#x306F;&#x76EE;&#x3082;&#x304F;&#x308C;&#x306A;&#x3044;&#x3068;&#x3044;&#x3046;&#x65B9;&#x6CD5;&#x3067;&#x3059;&#x3002; &#x2013; Linus Torvalds</a>  </p>
</blockquote>
<p>&#x300C;&#x305D;&#x308C;&#x3058;&#x3083;&#x3042;magit&#x306B;&#x6163;&#x308C;&#x305F;&#x541B;&#x306F;GitHub&#x306B;&#x30B3;&#x30DF;&#x30C3;&#x30C8;&#x3059;&#x308B;&#x65B9;&#x6CD5;&#x3082;&#x308F;&#x304B;&#x308A;&#x3084;&#x3059;&#x304F;&#x66F8;&#x304D;&#x76F4;&#x3057;&#x3066;&#x304F;&#x308C;&#x308B;&#x3093;&#x3060;&#x308D;&#x3046;&#x306A;&#x300D;EeePC&#x304C;&#x610F;&#x5730;&#x60AA;&#x305D;&#x3046;&#x306B;&#x8A00;&#x3046;&#x3002;&#x300C;&#x3046;&#x30FC;&#x3093;&#xFF0C;&#x4E0A;&#x306E;&#x753B;&#x50CF;&#x3068;&#x3084;&#x3063;&#x3066;&#x308B;&#x3053;&#x3068;&#x540C;&#x3058;&#x306A;&#x3093;&#x3060;&#x3051;&#x3069;&#x2026;&#x300D;&#x300C;&#x305D;&#x308C;&#x3058;&#x3083;&#x3042;&#x8CEA;&#x554F;&#x3092;&#x5909;&#x3048;&#x3088;&#x3046;&#x3002;magit&#x3092;&#x4F7F;&#x3046;&#x3053;&#x3068;&#x306E;&#x5229;&#x70B9;&#x306F;&#xFF1F;&#x300D;&#x300C;&#x697D;&#x3057;&#x3044;&#x3067;&#x3059;!&#x300D;&#x300C;&#x304A;&#xFF0C;&#x304A;&#x3046;&#x2026;&#x300D;&#x300C;&#x30ED;&#x30B0;&#x3068;&#x304B;&#x4FEE;&#x6B63;&#x7B87;&#x6240;&#x898B;&#x305F;&#x308A;&#xFF0C;&#x305D;&#x3053;&#x304B;&#x3089;&#x30D6;&#x30E9;&#x30F3;&#x30C1;&#x5207;&#x3063;&#x305F;&#x308A;&#xFF0C;&#x5FC5;&#x8981;&#x306A;&#x30A2;&#x30A4;&#x30C6;&#x30E0;&#x3060;&#x3051;&#x30B9;&#x30C6;&#x30FC;&#x30B8;&#x30F3;&#x30B0;&#x3057;&#x305F;&#x308A;&#xFF0C;&#x30D7;&#x30C3;&#x30B7;&#x30E5;&#x524D;&#x306B;&#x30B3;&#x30DF;&#x30C3;&#x30C8;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x66F8;&#x304D;&#x76F4;&#x3057;&#x305F;&#x308A;&#xFF0C;&#x601D;&#x3044;&#x5207;&#x3063;&#x3066;&#x30EA;&#x30BB;&#x30C3;&#x30C8;&#x3057;&#x305F;&#x308A;&#x3002;&#x305F;&#x3076;&#x3093;&#x30BF;&#x30FC;&#x30DF;&#x30CA;&#x30EB;&#x3067;git&#x4F7F;&#x3063;&#x3066;&#x305F;&#x3089;&#x5168;&#x7136;&#x308F;&#x304B;&#x3089;&#x306A;&#x304B;&#x3063;&#x305F;&#x3068;&#x601D;&#x3046;&#x300D;  </p>
<p>&#x8208;&#x596E;&#x6C17;&#x5473;&#x306B;&#x8A00;&#x3046;&#x79C1;&#x3002;&#x305D;&#x308C;&#x3092;&#x805E;&#x3044;&#x305F;EeePC&#x306F;&#x5C11;&#x3057;&#x5B89;&#x5FC3;&#x3057;&#x305F;&#x3088;&#x3046;&#x3060;&#x3063;&#x305F;&#x3002;&#x300C;&#x8A71;&#x3092;&#x805E;&#x304F;&#x304B;&#x304E;&#x308A;&#xFF0C;&#x601D;&#x3044;&#x901A;&#x308A;&#x306B;&#x4F7F;&#x3048;&#x3066;&#x3044;&#x308B;&#x3088;&#x3046;&#x3060;&#x306A;&#x300D;&#x300C;&#x307E;&#x3060;&#x6A5F;&#x80FD;&#x306E;1%&#x3082;&#x4F7F;&#x3048;&#x3066;&#x306A;&#x3044;&#x3068;&#x601D;&#x3046;&#x3051;&#x3069;&#xFF0C;&#x3067;&#x3082;<a href="https://qiita.com/maueki/items/70dbf62d8bd2ee348274" target="_blank">&#x4E00;&#x5EA6;&#x6163;&#x308C;&#x305F;&#x3089;&#x3042;&#x307E;&#x308A;&#x306E;&#x4FBF;&#x5229;&#x3055;&#x306B;&#x624B;&#x653E;&#x305B;&#x306A;&#x304F;&#x306A;&#x308B;</a>&#x306E;&#x306F;&#x672C;&#x5F53;&#x3060;&#x3068;&#x601D;&#x3046;&#x300D;  </p>
<p><br><br>EeePC&#x306F;&#x3053;&#x308C;&#x307E;&#x3067;&#x306E;&#x8A71;&#x3092;&#x898B;&#x8FD4;&#x3057;&#x3066;&#x304B;&#x3089;&#x8A00;&#x3063;&#x305F;&#x3002;&#x300C;GitBook&#x3067;&#x6587;&#x66F8;&#x3092;&#x30D3;&#x30EB;&#x30C9;&#x3057;&#x305F;&#x3089;&#xFF0C;&#x76F4;&#x63A5;GitHub&#x306B;&#x30A2;&#x30C3;&#x30D7;&#x30ED;&#x30FC;&#x30C9;&#x3057;&#x3066;&#x3082;&#x3044;&#x3044;&#x3057;&#xFF0C;magit&#x3092;&#x4F7F;&#x3046;&#x3053;&#x3068;&#x3082;&#x3067;&#x304D;&#x308B;&#x308F;&#x3051;&#x3060;&#x306A;&#x300D;&#x300C;&#x305D;&#x3046;&#x305D;&#x3046;&#x3002;GitBook&#x3092;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x3059;&#x308C;&#x3070;&#x3042;&#x3068;&#x306F;&#x3054;&#x81EA;&#x7531;&#x306B;&#x300D;&#x300C;&#x541B;&#x306E;&#x5834;&#x5408;&#x306F;magit&#x306B;&#x56FA;&#x57F7;&#x3059;&#x308B;&#x308F;&#x3051;&#x3060;&#x300D;&#x300C;&#x56FA;&#x57F7;&#x3063;&#x3066;&#x2026;&#x9078;&#x3076;&#x3063;&#x3066;&#x8A00;&#x3063;&#x3066;&#x3088;&#x300D;&#x300C;&#x30DE;&#x30CB;&#x30E5;&#x30A2;&#x30EB;&#x3092;&#x898B;&#x308B;&#x3068;&#x4ED6;&#x306B;&#x3082;&#x3044;&#x308D;&#x3044;&#x308D;&#x6A5F;&#x80FD;&#x304C;&#x3042;&#x308B;&#x307F;&#x305F;&#x3044;&#x3060;&#x304C;&#x300D;&#x300C;&#x305D;&#x308C;&#x306F;&#x57FA;&#x672C;&#x306B;&#x6163;&#x308C;&#x3066;&#x304B;&#x3089;&#x306B;&#x3057;&#x307E;&#x3057;&#x3087;&#x3046;&#x300D;&#x300C;magit&#x307F;&#x305F;&#x3044;&#x306B;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x305D;&#x306E;&#x3068;&#x304A;&#x308A;!&#x300D;  </p>
<p><br><br>&#x2013; &#x4E86; &#x2013;  </p>
<p><br><br><br><br>(c) 2018 jamcha (jamcha.aa@gmail.com).  </p>
<p><img src="https://i.creativecommons.org/l/by-sa/4.0/88x31.png" alt="cc by-sa">  </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="03.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 03 - 四種の神器">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"04 - Magitサイクル","level":"1.5","depth":1,"previous":{"title":"03 - 四種の神器","level":"1.4","depth":1,"path":"03.md","ref":"03.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"04.md","mtime":"2018-07-24T20:14:56.900Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-07-24T20:15:12.744Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

